# 01 Importing Libraries

In [1]:
# Importing Libraries

import pandas as pd
import numpy as np
import os

## 01.1 Importing Data Frames

In [21]:
# Importing Data Frames

path = r'C:\JUPYTER\Instacart Basket Analysis'

#df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)
#df_ords2 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)
df_ords2 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)


df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

#df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'product'))

# 02 Working on the tasks from the material

In [3]:
# Create a dataframe

df_test = pd.DataFrame()

In [4]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [5]:
df_test

    mix
0     a
1     b
2     1
3  True

In [6]:
# Check columns for mixed types

for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print (col)

mix

In [7]:
df_test['mix'] = df_test['mix'].astype('str')

In [3]:
# Finding Missing Values

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [4]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [5]:
df_prods.shape

(49693, 5)

In [6]:
# Filtering the Missing values and saving all under new variable

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [7]:
df_prods_clean.shape

(49677, 5)

In [8]:
# Looking for duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]

df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [9]:
df_prods_clean.shape

(49677, 5)

In [10]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [11]:
df_prods_clean_no_dups.shape

(49672, 5)

## Exporting the Dataframe from within the materials task

In [12]:
# Exporting the Dataframe from within the materials task

df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

# 03 Working on the Directions from the task

## Direction 2

In [14]:
#df_prods.describe()

df_prods_clean_no_dups.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

I think the prices need to be investigated, the max value of '99999' seems odd.

## Direction 3

In [22]:
#Checking for mixed data types

for colu in df_ords.columns.tolist():
    odd = (df_ords[[colu]].applymap(type) != df_ords[[colu]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[odd]) > 0:
        print (colu)
        
# I checked 3 times, even with different variable names (as seen above), but I don't get any mixed data type columns.
# I even closed all jupyter notebooks (with close and halt), but I still don't get any odd results.

## Direction 5

In [23]:
# Checking for missing values

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

I already noted this on the behavior of user number 1 from last excercise. The first order was 'NaN', so I think that the first order is always 'NaN', because how can there be any day prior the last order, if it's the first?

## Direction 6

In [24]:
# Addressing the missing values

zero = -1

df_ords_nan = df_ords

df_ords_nan = df_ords_nan['days_since_prior_order'].fillna(zero, inplace = True)

In [25]:
#Testing what the output for days_since_prio_order = 0 is

df_ords_sub = df_ords.loc[df_ords['days_since_prior_order'].isin([-1])]

df_ords_sub

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,-1.0
11,11,2168274,2,1,2,11,-1.0
26,26,1374495,3,1,1,14,-1.0
39,39,3343014,4,1,6,11,-1.0
45,45,2717275,5,1,3,12,-1.0
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,-1.0
3420934,3420934,3189322,206206,1,3,18,-1.0
3421002,3421002,2166133,206207,1,6,19,-1.0
3421019,3421019,2227043,206208,1,1,15,-1.0
3421069,3421069,3154581,206209,1,3,11,-1.0

In [26]:
#Testing what the normal output for days_since_prio_order = 0 is before change, using a second imported data frame

df_ords_not_sub = df_ords2.loc[df_ords2['days_since_prior_order'].isin([0])]

df_ords_not_sub

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
8,8,2295261,1,9,1,16,0.0
43,43,2557754,4,5,5,13,0.0
189,189,2148135,17,30,6,15,0.0
296,296,965160,24,19,0,16,0.0
337,337,3162630,27,24,2,15,0.0
...,...,...,...,...,...,...,...
3420980,3420980,4277,206206,47,2,17,0.0
3420985,3420985,648225,206206,52,0,19,0.0
3420991,3420991,2475308,206206,58,0,15,0.0
3421001,3421001,1043943,206206,68,0,20,0.0
3421044,3421044,2079142,206208,26,2,16,0.0

I introduced a new variable, zero with the value 0 and then filled the missing values within the dataset with those zeros.
Afterwards I checked if the count of zeros is corrected and panicked for a second, because it's not. But then I remembered
that user number 1 also had a day since prior order with the value of 0 meaning he/she ordered two days in a row.

273964 - 67755 = 206209

#### EDIT:

Now I, instead of replacing the missing values with 0 i replaced them with '-1', as a sign, that the user is ordering for the first time. I could also add another column, etc. But replacing the missing ones with 0 might be misleading. Although the replacement with '-1' might be misleading as well, but I still think it's better than 0.

## Direction 7

In [27]:
# Checking df_ords for duplicates

df_ords_dups = df_ords[df_ords.duplicated()]

df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [28]:

df_ords_summing = df_ords.duplicated().sum()

df_ords_summing

0

In [32]:

df_ords_summing_test = df_ords['days_since_prior_order'].duplicated().sum()

df_ords_summing_test

3421051

In [33]:
df_ords.shape

(3421083, 7)

In [34]:
df_ords.tail()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

For direction 7 I used 2 things once the method we learned, then a summing method and a test, if my summing method actually worked an a single column alone. So far, I can't say that I've found duplicates. Maybe I made something wrong.

Anyway, I exported the csv, loaded it into excel to at least have a quick check for the firs 'few' rows. I didn't find any duplicates in excel as well.

## 03.1 Exporting the dataframes

In [ ]:
# Exporting the data frames

df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'))